In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"name":['harry','rohan','subh','biswas'],
       "marks":[99,67,78,90],
       "city":["delhi","kolkata","dehradun","bhubaneswar"]}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks         city
0   harry     99        delhi
1   rohan     67      kolkata
2    subh     78     dehradun
3  biswas     90  bhubaneswar

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv',index=False)

In [7]:
df.describe()

          marks
count   4.00000
mean   83.50000
std    13.96424
min    67.00000
25%    75.25000
50%    84.00000
75%    92.25000
max    99.00000

In [8]:
harry=pd.read_csv('friends_index_false.csv')

In [9]:
harry

     name  marks         city
0   harry     99        delhi
1   rohan     67      kolkata
2    subh     78     dehradun
3  biswas     90  bhubaneswar

In [10]:
harry['marks'][0]=100

C:\Users\bibas\AppData\Local\Temp\ipykernel_1068\3894485276.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  harry['marks'][0]=100
C:\Users\bibas\AppData\Local\Temp\ipykernel_1068\3894485276.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['marks'][0]=100

In [11]:
harry

     name  marks         city
0   harry    100        delhi
1   rohan     67      kolkata
2    subh     78     dehradun
3  biswas     90  bhubaneswar

In [12]:
harry.index=['first','second','third','fourth']

In [13]:
harry

          name  marks         city
first    harry    100        delhi
second   rohan     67      kolkata
third     subh     78     dehradun
fourth  biswas     90  bhubaneswar

In [14]:
harry['marks']

first     100
second     67
third      78
fourth     90
Name: marks, dtype: int64

In [15]:
type(harry['marks'])

pandas.core.series.Series

In [16]:
ser=pd.Series(np.random.randint(30,size=30))

In [17]:
ser

0     23
1      1
2      4
3      6
4      1
5     18
6     11
7     16
8     23
9      8
10    16
11    29
12    13
13    21
14    11
15    18
16    20
17     6
18     9
19     6
20    11
21    28
22     9
23    18
24     8
25    26
26    14
27    17
28    17
29    14
dtype: int32

In [18]:
ser=pd.Series(np.random.rand(30))

In [19]:
ser

0     0.958764
1     0.936930
2     0.056581
3     0.094446
4     0.559336
5     0.608240
6     0.293401
7     0.176182
8     0.684254
9     0.980633
10    0.194620
11    0.453623
12    0.231832
13    0.405071
14    0.386949
15    0.276301
16    0.031396
17    0.124808
18    0.186094
19    0.382960
20    0.482198
21    0.105608
22    0.071155
23    0.264291
24    0.169020
25    0.310676
26    0.814223
27    0.535155
28    0.706969
29    0.737604
dtype: float64

In [20]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [21]:
newdf

            0         1         2         3         4
0    0.658415  0.587529  0.718689  0.236973  0.511234
1    0.697205  0.667920  0.472180  0.473504  0.120086
2    0.436465  0.490421  0.930649  0.504713  0.807359
3    0.533250  0.653546  0.663273  0.194309  0.311484
4    0.493449  0.255275  0.537127  0.252886  0.112611
..        ...       ...       ...       ...       ...
329  0.428195  0.565264  0.054556  0.302566  0.441749
330  0.853005  0.869072  0.810033  0.606732  0.990933
331  0.792019  0.416989  0.076289  0.227863  0.927277
332  0.076407  0.197724  0.920966  0.788563  0.814702
333  0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [22]:
newdf.transpose()

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.658415,0.697205,0.436465,0.533250,0.493449,0.542132,0.223905,0.990635,0.431641,0.098026,...,0.174615,0.068971,0.657638,0.480481,0.867473,0.428195,0.853005,0.792019,0.076407,0.915628
1,0.587529,0.667920,0.490421,0.653546,0.255275,0.799326,0.671117,0.426432,0.585548,0.652775,...,0.498514,0.795037,0.476762,0.613985,0.358256,0.565264,0.869072,0.416989,0.197724,0.745156
2,0.718689,0.472180,0.930649,0.663273,0.537127,0.219794,0.380571,0.192994,0.328893,0.163931,...,0.454804,0.146143,0.859902,0.334436,0.336662,0.054556,0.810033,0.076289,0.920966,0.727207
3,0.236973,0.473504,0.504713,0.194309,0.252886,0.333477,0.116211,0.135831,0.846455,0.308732,...,0.822622,0.609510,0.171297,0.618186,0.757766,0.302566,0.606732,0.227863,0.788563,0.448318
4,0.511234,0.120086,0.807359,0.311484,0.112611,0.283019,0.446982,0.321038,0.217520,0.539657,...,0.057590,0.204641,0.425471,0.078838,0.990355,0.441749,0.990933,0.927277,0.814702,0.035228

In [23]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.514126    0.490176    0.493276    0.483909    0.488072
std      0.285047    0.290176    0.291220    0.278964    0.280787
min      0.010313    0.001849    0.001066    0.001818    0.003009
25%      0.256693    0.227145    0.247839    0.253981    0.262278
50%      0.515518    0.490762    0.474405    0.474479    0.472190
75%      0.760764    0.764566    0.753060    0.708605    0.703578
max      0.997893    0.995850    0.995564    0.987101    0.999914

In [24]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
newdf.to_numpy()#it will convert to a numpy array

array([[0.65841462, 0.587529  , 0.71868871, 0.23697323, 0.51123432],
       [0.69720502, 0.66792024, 0.4721799 , 0.47350429, 0.12008551],
       [0.43646511, 0.49042079, 0.93064919, 0.50471277, 0.80735923],
       ...,
       [0.7920193 , 0.41698907, 0.07628888, 0.22786318, 0.92727748],
       [0.07640717, 0.19772438, 0.92096558, 0.78856289, 0.81470158],
       [0.91562848, 0.74515586, 0.72720696, 0.44831802, 0.03522811]])

In [26]:
newdf[0][0]=0.696969696

C:\Users\bibas\AppData\Local\Temp\ipykernel_1068\3022759497.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]=0.696969696

In [27]:
newdf

            0         1         2         3         4
0    0.696970  0.587529  0.718689  0.236973  0.511234
1    0.697205  0.667920  0.472180  0.473504  0.120086
2    0.436465  0.490421  0.930649  0.504713  0.807359
3    0.533250  0.653546  0.663273  0.194309  0.311484
4    0.493449  0.255275  0.537127  0.252886  0.112611
..        ...       ...       ...       ...       ...
329  0.428195  0.565264  0.054556  0.302566  0.441749
330  0.853005  0.869072  0.810033  0.606732  0.990933
331  0.792019  0.416989  0.076289  0.227863  0.927277
332  0.076407  0.197724  0.920966  0.788563  0.814702
333  0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [28]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [29]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [30]:
newdf.sort_index(axis=0,ascending=False)#axis=0 for rows and axis=1 for columns for 2-D numpy array default axis is 0

            0         1         2         3         4
333  0.915628  0.745156  0.727207  0.448318  0.035228
332  0.076407  0.197724  0.920966  0.788563  0.814702
331  0.792019  0.416989  0.076289  0.227863  0.927277
330  0.853005  0.869072  0.810033  0.606732  0.990933
329  0.428195  0.565264  0.054556  0.302566  0.441749
..        ...       ...       ...       ...       ...
4    0.493449  0.255275  0.537127  0.252886  0.112611
3    0.533250  0.653546  0.663273  0.194309  0.311484
2    0.436465  0.490421  0.930649  0.504713  0.807359
1    0.697205  0.667920  0.472180  0.473504  0.120086
0    0.696970  0.587529  0.718689  0.236973  0.511234

[334 rows x 5 columns]

In [31]:
newdf2=newdf#here newdf2 is view of newdf dataframe so any changes in newdf2(i.e.view) will reflect to newdf.

In [32]:
newdf2[0][0]=12234

C:\Users\bibas\AppData\Local\Temp\ipykernel_1068\2421045811.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=12234

In [33]:
newdf2

                0         1         2         3         4
0    12234.000000  0.587529  0.718689  0.236973  0.511234
1        0.697205  0.667920  0.472180  0.473504  0.120086
2        0.436465  0.490421  0.930649  0.504713  0.807359
3        0.533250  0.653546  0.663273  0.194309  0.311484
4        0.493449  0.255275  0.537127  0.252886  0.112611
..            ...       ...       ...       ...       ...
329      0.428195  0.565264  0.054556  0.302566  0.441749
330      0.853005  0.869072  0.810033  0.606732  0.990933
331      0.792019  0.416989  0.076289  0.227863  0.927277
332      0.076407  0.197724  0.920966  0.788563  0.814702
333      0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [34]:
newdf

                0         1         2         3         4
0    12234.000000  0.587529  0.718689  0.236973  0.511234
1        0.697205  0.667920  0.472180  0.473504  0.120086
2        0.436465  0.490421  0.930649  0.504713  0.807359
3        0.533250  0.653546  0.663273  0.194309  0.311484
4        0.493449  0.255275  0.537127  0.252886  0.112611
..            ...       ...       ...       ...       ...
329      0.428195  0.565264  0.054556  0.302566  0.441749
330      0.853005  0.869072  0.810033  0.606732  0.990933
331      0.792019  0.416989  0.076289  0.227863  0.927277
332      0.076407  0.197724  0.920966  0.788563  0.814702
333      0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [35]:
newdf2=newdf.copy()#here no changes in newdf2(i.e.view) will not reflect to newdf or newdf2=newdf[:]

In [36]:
newdf2[0][0]=69

C:\Users\bibas\AppData\Local\Temp\ipykernel_1068\3725749648.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=69

In [37]:
newdf2

             0         1         2         3         4
0    69.000000  0.587529  0.718689  0.236973  0.511234
1     0.697205  0.667920  0.472180  0.473504  0.120086
2     0.436465  0.490421  0.930649  0.504713  0.807359
3     0.533250  0.653546  0.663273  0.194309  0.311484
4     0.493449  0.255275  0.537127  0.252886  0.112611
..         ...       ...       ...       ...       ...
329   0.428195  0.565264  0.054556  0.302566  0.441749
330   0.853005  0.869072  0.810033  0.606732  0.990933
331   0.792019  0.416989  0.076289  0.227863  0.927277
332   0.076407  0.197724  0.920966  0.788563  0.814702
333   0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [38]:
newdf

                0         1         2         3         4
0    12234.000000  0.587529  0.718689  0.236973  0.511234
1        0.697205  0.667920  0.472180  0.473504  0.120086
2        0.436465  0.490421  0.930649  0.504713  0.807359
3        0.533250  0.653546  0.663273  0.194309  0.311484
4        0.493449  0.255275  0.537127  0.252886  0.112611
..            ...       ...       ...       ...       ...
329      0.428195  0.565264  0.054556  0.302566  0.441749
330      0.853005  0.869072  0.810033  0.606732  0.990933
331      0.792019  0.416989  0.076289  0.227863  0.927277
332      0.076407  0.197724  0.920966  0.788563  0.814702
333      0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [39]:
newdf.loc[0,0]=654#in order to resolve ChainedAssignmentError we use loc.

In [40]:
newdf

              0         1         2         3         4
0    654.000000  0.587529  0.718689  0.236973  0.511234
1      0.697205  0.667920  0.472180  0.473504  0.120086
2      0.436465  0.490421  0.930649  0.504713  0.807359
3      0.533250  0.653546  0.663273  0.194309  0.311484
4      0.493449  0.255275  0.537127  0.252886  0.112611
..          ...       ...       ...       ...       ...
329    0.428195  0.565264  0.054556  0.302566  0.441749
330    0.853005  0.869072  0.810033  0.606732  0.990933
331    0.792019  0.416989  0.076289  0.227863  0.927277
332    0.076407  0.197724  0.920966  0.788563  0.814702
333    0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [41]:
newdf.columns=list("ABCDE")

In [42]:
newdf

              A         B         C         D         E
0    654.000000  0.587529  0.718689  0.236973  0.511234
1      0.697205  0.667920  0.472180  0.473504  0.120086
2      0.436465  0.490421  0.930649  0.504713  0.807359
3      0.533250  0.653546  0.663273  0.194309  0.311484
4      0.493449  0.255275  0.537127  0.252886  0.112611
..          ...       ...       ...       ...       ...
329    0.428195  0.565264  0.054556  0.302566  0.441749
330    0.853005  0.869072  0.810033  0.606732  0.990933
331    0.792019  0.416989  0.076289  0.227863  0.927277
332    0.076407  0.197724  0.920966  0.788563  0.814702
333    0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [43]:
newdf.loc[0,0]=69

In [44]:
newdf

              A         B         C         D         E     0
0    654.000000  0.587529  0.718689  0.236973  0.511234  69.0
1      0.697205  0.667920  0.472180  0.473504  0.120086   NaN
2      0.436465  0.490421  0.930649  0.504713  0.807359   NaN
3      0.533250  0.653546  0.663273  0.194309  0.311484   NaN
4      0.493449  0.255275  0.537127  0.252886  0.112611   NaN
..          ...       ...       ...       ...       ...   ...
329    0.428195  0.565264  0.054556  0.302566  0.441749   NaN
330    0.853005  0.869072  0.810033  0.606732  0.990933   NaN
331    0.792019  0.416989  0.076289  0.227863  0.927277   NaN
332    0.076407  0.197724  0.920966  0.788563  0.814702   NaN
333    0.915628  0.745156  0.727207  0.448318  0.035228   NaN

[334 rows x 6 columns]

In [45]:
newdf.loc[0,'A']=65445

In [46]:
newdf

                A         B         C         D         E     0
0    65445.000000  0.587529  0.718689  0.236973  0.511234  69.0
1        0.697205  0.667920  0.472180  0.473504  0.120086   NaN
2        0.436465  0.490421  0.930649  0.504713  0.807359   NaN
3        0.533250  0.653546  0.663273  0.194309  0.311484   NaN
4        0.493449  0.255275  0.537127  0.252886  0.112611   NaN
..            ...       ...       ...       ...       ...   ...
329      0.428195  0.565264  0.054556  0.302566  0.441749   NaN
330      0.853005  0.869072  0.810033  0.606732  0.990933   NaN
331      0.792019  0.416989  0.076289  0.227863  0.927277   NaN
332      0.076407  0.197724  0.920966  0.788563  0.814702   NaN
333      0.915628  0.745156  0.727207  0.448318  0.035228   NaN

[334 rows x 6 columns]

In [47]:
newdf.drop(0,axis=1)#temporary operation since result is visible in screen.

                A         B         C         D         E
0    65445.000000  0.587529  0.718689  0.236973  0.511234
1        0.697205  0.667920  0.472180  0.473504  0.120086
2        0.436465  0.490421  0.930649  0.504713  0.807359
3        0.533250  0.653546  0.663273  0.194309  0.311484
4        0.493449  0.255275  0.537127  0.252886  0.112611
..            ...       ...       ...       ...       ...
329      0.428195  0.565264  0.054556  0.302566  0.441749
330      0.853005  0.869072  0.810033  0.606732  0.990933
331      0.792019  0.416989  0.076289  0.227863  0.927277
332      0.076407  0.197724  0.920966  0.788563  0.814702
333      0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [48]:
newdf

                A         B         C         D         E     0
0    65445.000000  0.587529  0.718689  0.236973  0.511234  69.0
1        0.697205  0.667920  0.472180  0.473504  0.120086   NaN
2        0.436465  0.490421  0.930649  0.504713  0.807359   NaN
3        0.533250  0.653546  0.663273  0.194309  0.311484   NaN
4        0.493449  0.255275  0.537127  0.252886  0.112611   NaN
..            ...       ...       ...       ...       ...   ...
329      0.428195  0.565264  0.054556  0.302566  0.441749   NaN
330      0.853005  0.869072  0.810033  0.606732  0.990933   NaN
331      0.792019  0.416989  0.076289  0.227863  0.927277   NaN
332      0.076407  0.197724  0.920966  0.788563  0.814702   NaN
333      0.915628  0.745156  0.727207  0.448318  0.035228   NaN

[334 rows x 6 columns]

In [49]:
newdf=newdf.drop(0,axis=1)#permanent operation since result is not visible in screen.

In [50]:
newdf

                A         B         C         D         E
0    65445.000000  0.587529  0.718689  0.236973  0.511234
1        0.697205  0.667920  0.472180  0.473504  0.120086
2        0.436465  0.490421  0.930649  0.504713  0.807359
3        0.533250  0.653546  0.663273  0.194309  0.311484
4        0.493449  0.255275  0.537127  0.252886  0.112611
..            ...       ...       ...       ...       ...
329      0.428195  0.565264  0.054556  0.302566  0.441749
330      0.853005  0.869072  0.810033  0.606732  0.990933
331      0.792019  0.416989  0.076289  0.227863  0.927277
332      0.076407  0.197724  0.920966  0.788563  0.814702
333      0.915628  0.745156  0.727207  0.448318  0.035228

[334 rows x 5 columns]

In [51]:
newdf.loc[[1,2],['C','D']]#it takes (row name,column name)

          C         D
1  0.472180  0.473504
2  0.930649  0.504713

In [52]:
newdf.iloc[[1,2],[2,3]]#it takes (row index,column index)

          C         D
1  0.472180  0.473504
2  0.930649  0.504713

In [53]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.697205  0.667920  0.472180  0.473504  0.120086
2  0.436465  0.490421  0.930649  0.504713  0.807359

In [54]:
newdf.loc[(newdf['A']>0.3) & (newdf['C']<0.1)]

            A         B         C         D         E
14   0.820891  0.772559  0.055582  0.462761  0.665505
76   0.573491  0.840740  0.024589  0.961590  0.017190
79   0.706018  0.148274  0.067737  0.435003  0.891919
105  0.338518  0.957335  0.032003  0.026789  0.747629
124  0.649972  0.797611  0.088461  0.918755  0.590776
129  0.562458  0.781029  0.072045  0.727484  0.163093
142  0.566610  0.373316  0.024890  0.577010  0.319239
156  0.750454  0.681524  0.084711  0.349101  0.858758
160  0.946056  0.728147  0.018371  0.318963  0.092969
188  0.704955  0.438166  0.063376  0.975541  0.823733
210  0.322796  0.979881  0.022601  0.175225  0.612431
218  0.777646  0.725788  0.001066  0.001818  0.394403
222  0.319415  0.192949  0.009218  0.071619  0.488097
239  0.921081  0.743989  0.084239  0.008491  0.144167
251  0.542875  0.791473  0.056787  0.870195  0.914776
271  0.611637  0.269153  0.009337  0.235518  0.247672
281  0.401629  0.806755  0.032293  0.837279  0.013455
283  0.766538  0.852091  0.009730  0.144798  0.499718
302  0.976990  0.121662  0.050718  0.326434  0.160319
308  0.606265  0.325470  0.061208  0.606062  0.424699
321  0.334089  0.682447  0.063601  0.532462  0.601552
329  0.428195  0.565264  0.054556  0.302566  0.441749
331  0.792019  0.416989  0.076289  0.227863  0.927277

In [55]:
newdf.iloc[0,4]

0.5112343151105904

In [56]:
newdf.drop(['A'],axis=1)

            B         C         D         E
0    0.587529  0.718689  0.236973  0.511234
1    0.667920  0.472180  0.473504  0.120086
2    0.490421  0.930649  0.504713  0.807359
3    0.653546  0.663273  0.194309  0.311484
4    0.255275  0.537127  0.252886  0.112611
..        ...       ...       ...       ...
329  0.565264  0.054556  0.302566  0.441749
330  0.869072  0.810033  0.606732  0.990933
331  0.416989  0.076289  0.227863  0.927277
332  0.197724  0.920966  0.788563  0.814702
333  0.745156  0.727207  0.448318  0.035228

[334 rows x 4 columns]

In [57]:
newdf.drop([0],axis=0)

            A         B         C         D         E
1    0.697205  0.667920  0.472180  0.473504  0.120086
2    0.436465  0.490421  0.930649  0.504713  0.807359
3    0.533250  0.653546  0.663273  0.194309  0.311484
4    0.493449  0.255275  0.537127  0.252886  0.112611
5    0.542132  0.799326  0.219794  0.333477  0.283019
..        ...       ...       ...       ...       ...
329  0.428195  0.565264  0.054556  0.302566  0.441749
330  0.853005  0.869072  0.810033  0.606732  0.990933
331  0.792019  0.416989  0.076289  0.227863  0.927277
332  0.076407  0.197724  0.920966  0.788563  0.814702
333  0.915628  0.745156  0.727207  0.448318  0.035228

[333 rows x 5 columns]

In [58]:
newdf.drop(['A','C'],axis=1,inplace=True)

In [59]:
newdf #or use newdf=newdf.drop(['A','C'],axis=1,it is a permanent operation

            B         D         E
0    0.587529  0.236973  0.511234
1    0.667920  0.473504  0.120086
2    0.490421  0.504713  0.807359
3    0.653546  0.194309  0.311484
4    0.255275  0.252886  0.112611
..        ...       ...       ...
329  0.565264  0.302566  0.441749
330  0.869072  0.606732  0.990933
331  0.416989  0.227863  0.927277
332  0.197724  0.788563  0.814702
333  0.745156  0.448318  0.035228

[334 rows x 3 columns]

In [60]:
newdf.drop([1,5],axis=0,inplace=True)

In [61]:
newdf

            B         D         E
0    0.587529  0.236973  0.511234
2    0.490421  0.504713  0.807359
3    0.653546  0.194309  0.311484
4    0.255275  0.252886  0.112611
6    0.671117  0.116211  0.446982
..        ...       ...       ...
329  0.565264  0.302566  0.441749
330  0.869072  0.606732  0.990933
331  0.416989  0.227863  0.927277
332  0.197724  0.788563  0.814702
333  0.745156  0.448318  0.035228

[332 rows x 3 columns]

In [62]:
newdf.reset_index()

     index         B         D         E
0        0  0.587529  0.236973  0.511234
1        2  0.490421  0.504713  0.807359
2        3  0.653546  0.194309  0.311484
3        4  0.255275  0.252886  0.112611
4        6  0.671117  0.116211  0.446982
..     ...       ...       ...       ...
327    329  0.565264  0.302566  0.441749
328    330  0.869072  0.606732  0.990933
329    331  0.416989  0.227863  0.927277
330    332  0.197724  0.788563  0.814702
331    333  0.745156  0.448318  0.035228

[332 rows x 4 columns]

In [63]:
newdf.reset_index(drop=True,inplace=True)#drop=True will delete the index column

In [64]:
newdf

            B         D         E
0    0.587529  0.236973  0.511234
1    0.490421  0.504713  0.807359
2    0.653546  0.194309  0.311484
3    0.255275  0.252886  0.112611
4    0.671117  0.116211  0.446982
..        ...       ...       ...
327  0.565264  0.302566  0.441749
328  0.869072  0.606732  0.990933
329  0.416989  0.227863  0.927277
330  0.197724  0.788563  0.814702
331  0.745156  0.448318  0.035228

[332 rows x 3 columns]

In [65]:
newdf.iloc[:,1]

0      0.236973
1      0.504713
2      0.194309
3      0.252886
4      0.116211
         ...
327    0.302566
328    0.606732
329    0.227863
330    0.788563
331    0.448318
Name: D, Length: 332, dtype: float64

In [66]:
newdf.iloc[:,[1]]

            D
0    0.236973
1    0.504713
2    0.194309
3    0.252886
4    0.116211
..        ...
327  0.302566
328  0.606732
329  0.227863
330  0.788563
331  0.448318

[332 rows x 1 columns]

In [67]:
newdf.loc[:,['B']]=69

In [68]:
newdf

        B         D         E
0    69.0  0.236973  0.511234
1    69.0  0.504713  0.807359
2    69.0  0.194309  0.311484
3    69.0  0.252886  0.112611
4    69.0  0.116211  0.446982
..    ...       ...       ...
327  69.0  0.302566  0.441749
328  69.0  0.606732  0.990933
329  69.0  0.227863  0.927277
330  69.0  0.788563  0.814702
331  69.0  0.448318  0.035228

[332 rows x 3 columns]

In [69]:
newdf.loc['B']=None

In [70]:
newdf

        B         D         E
0    69.0  0.236973  0.511234
1    69.0  0.504713  0.807359
2    69.0  0.194309  0.311484
3    69.0  0.252886  0.112611
4    69.0  0.116211  0.446982
..    ...       ...       ...
328  69.0  0.606732  0.990933
329  69.0  0.227863  0.927277
330  69.0  0.788563  0.814702
331  69.0  0.448318  0.035228
B     NaN       NaN       NaN

[333 rows x 3 columns]

In [71]:
newdf.drop(['B'],axis=0,inplace=True)

In [72]:
newdf

        B         D         E
0    69.0  0.236973  0.511234
1    69.0  0.504713  0.807359
2    69.0  0.194309  0.311484
3    69.0  0.252886  0.112611
4    69.0  0.116211  0.446982
..    ...       ...       ...
327  69.0  0.302566  0.441749
328  69.0  0.606732  0.990933
329  69.0  0.227863  0.927277
330  69.0  0.788563  0.814702
331  69.0  0.448318  0.035228

[332 rows x 3 columns]

In [73]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [74]:
newdf

        B         D         E
0    69.0  0.236973  0.511234
1    69.0  0.504713  0.807359
2    69.0  0.194309  0.311484
3    69.0  0.252886  0.112611
4    69.0  0.116211  0.446982
..    ...       ...       ...
327  69.0  0.302566  0.441749
328  69.0  0.606732  0.990933
329  69.0  0.227863  0.927277
330  69.0  0.788563  0.814702
331  69.0  0.448318  0.035228

[332 rows x 3 columns]

In [75]:
newdf.loc[:,['B']]=0

In [76]:
newdf

       B         D         E
0    0.0  0.236973  0.511234
1    0.0  0.504713  0.807359
2    0.0  0.194309  0.311484
3    0.0  0.252886  0.112611
4    0.0  0.116211  0.446982
..   ...       ...       ...
327  0.0  0.302566  0.441749
328  0.0  0.606732  0.990933
329  0.0  0.227863  0.927277
330  0.0  0.788563  0.814702
331  0.0  0.448318  0.035228

[332 rows x 3 columns]

In [77]:
newdf.loc[:,['B']].isnull()

         B
0    False
1    False
2    False
3    False
4    False
..     ...
327  False
328  False
329  False
330  False
331  False

[332 rows x 1 columns]

In [78]:
df=pd.DataFrame({"name":['alfred','batman','catwoman'],
                 "toy":[np.nan,'batmobile','bullwhip'],
                 "born":[pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT]} )

In [79]:
df

       name        toy       born
0    alfred        NaN        NaT
1    batman  batmobile 1940-04-25
2  catwoman   bullwhip        NaT

In [80]:
df.dropna()

     name        toy       born
1  batman  batmobile 1940-04-25

In [81]:
df.dropna(axis=1)

       name
0    alfred
1    batman
2  catwoman

In [82]:
df.dropna(how="all")

       name        toy       born
0    alfred        NaN        NaT
1    batman  batmobile 1940-04-25
2  catwoman   bullwhip        NaT

In [83]:
data={"name":['bibas','ansh','suvam','biswas'],
       "marks":[99,67,78,90],
       "city":["delhi","kolkata","dehradun","bhubaneswar"]}

In [84]:
df=pd.DataFrame(data)

In [85]:
df

     name  marks         city
0   bibas     99        delhi
1    ansh     67      kolkata
2   suvam     78     dehradun
3  biswas     90  bhubaneswar

In [86]:
df.to_excel('data.xlsx')

In [88]:
df.loc[[0],['marks']]=100

In [89]:
df

     name  marks         city
0   bibas    100        delhi
1    ansh     67      kolkata
2   suvam     78     dehradun
3  biswas     90  bhubaneswar

In [ ]:
data=pd.read_excel('data.xlsx')